{
    "work_experience": [
      {
        "company_name": "Tesla",
        "role": "Data Engineer",
        "start_date": "09/2023",
        "end_date": "01/2025",
        "description": "During my tenure at Tesla as a Data Engineer, I spearheaded the development of Grafana dashboards to monitor real-time production metrics, delivering high-quality insights to over 100 stakeholders. I designed and implemented robust ETL pipelines in Airflow with Python and SQL to ensure data quality and reliability across key metrics, and created visual dashboards to track KPIs such as machine performance and uptime—providing actionable insights for effective decision-making. I also implemented comprehensive data visualizations that tracked machine states, enabling management to swiftly address downtime root causes and enhance productivity. In addition, I built real-time data ingestion pipelines that integrated sensor and machine data from PLCs into centralized data warehouses and marts, developed YAML files for CI/CD automation to ensure consistent code integration, and deployed applications and data pipelines in Kubernetes clusters using Docker for enhanced scalability and manageability. Furthermore, I created personalized dashboard plugins that allowed users to input reasons for machine states, leveraging Pareto and pie charts to analyze downtime, and collaborated with software engineering teams to optimize data pipelines using PySpark for large-scale distributed processing. I also optimized the backend of a Grafana plugin using Golang and improved its frontend using TypeScript and React, resulting in significant improvements in processing speed and overall efficiency."
    },
      {
        "company_name": "GetSteps",
        "role": "Business Intelligence Analyst",
        "start_date": "12/2022",
        "end_date": "04/2023",
        "description": "At GetSteps, I designed and implemented robust data pipelines using PostgreSQL and dbt, significantly improving data availability and streamlining ETL workflows. I developed custom dashboards and KPI comparison reports in Metabase that provided critical insights into marketing performance and customer engagement. By enhancing data marts with additional KPIs, I enabled detailed cohort analysis for the marketing team, while also establishing a new data model and reorganizing the data marts to improve governance and transparency of key metrics. I conducted custom cohort analyses using Jupyter Notebooks to examine Customer Lifetime Value (CLV) and created a comprehensive shopping funnel report with KPIs and visualizations. Additionally, I generated overview reports for outstanding orders involving discontinued cover materials to assist the production team in inventory management, performed ad-hoc analyses for the CEO—including segmented sales performance reports for B2B and B2B2C—and leveraged Google Analytics and Airbyte to import data from multiple sources, thereby enhancing overall data comprehensiveness."
    },
      {
        "company_name": "Europcar Mobility Group",
        "role": "Business Intelligence Analyst",
        "start_date": "09/2021",
        "end_date": "11/2022",
        "description": "At Europcar Mobility Group, I designed reports using SAP Business Objects (BO) and Google Data Studio to provide actionable insights that supported strategic decision-making. I implemented ETL pipelines in BigQuery using SQL to extract and integrate data from SAP BO and Oracle, ensuring high data accuracy and consistency. Additionally, I built dynamic dashboards in Looker to empower stakeholders across departments to track key performance metrics effectively. I automated reporting processes using VBA macros in Excel and Access, significantly reducing manual effort, and managed the scheduling of automated report generation in SAP BO and virtual machines. I also developed detailed documentation for data marts and dashboards to support data governance initiatives, maintained and updated the company’s data model across multiple sources, and conducted training sessions for business users to enhance their ability to utilize these analytical tools."
    },
      {
        "company_name": "Rohde & Schwarz",
        "role": "BI Software Developer",
        "start_date": "04/2021",
        "end_date": "07/2021",
        "description": "At Rohde & Schwarz, I developed robust time series forecasting models in Tableau and Python to accurately predict sales trends and optimize inventory management. I created interactive dashboards in Tableau that enabled stakeholders to analyze sales performance and derive actionable insights. Additionally, I presented data-driven visualizations to support informed decision-making and designed as well as maintained comprehensive ETL workflows using SQL to ensure consistent and reliable data integration across the organization."
    }
    ],
    "projects": [
      {
        "project_title": "Aircraft Design Improvement using ML and Gen AI",
        "description": "In this project, I utilized machine learning and deep learning techniques—including Random Forest, KNN, CNN, and Generative AI models—to predict key aircraft parameters such as range and flight mechanics. The project involved extensive data preprocessing, model training, and evaluation to ensure that the predictive models could accurately inform improvements in aircraft design."
      },
      {
        "project_title": "Enhancing Movie Recommendations with Behavior Sequence Transformer",
        "description": "I developed a Transformer-based behavior sequence model for a movie recommendation system, training it on a dataset of 5 million entries. The project involved comparing its performance with traditional recommendation methods, ultimately enhancing user personalization by leveraging TensorFlow and Keras."
      },
      {
        "project_title": "Financial News Sentiment Analysis",
        "description": "This project involved classifying financial news articles into positive, neutral, or negative sentiments using a combination of machine learning and deep learning techniques. I utilized tools such as NLTK, TensorFlow, Keras, and Scikit-learn to preprocess data, train models, and achieve accurate sentiment analysis for informed decision-making."
      },
      {
        "project_title": "Stock Price Prediction using LSTM & Fbprophet",
        "description": "I implemented time series forecasting models using LSTM, ARIMA, and Facebook Prophet to predict stock prices. The project included data preparation, model development, and performance comparison, ultimately identifying the most effective forecasting approach."
      },
      {
        "project_title": "Customer Segmentation using Deep Learning",
        "description": "In this project, I developed a deep learning-based customer segmentation model that achieved 98% accuracy. This model was used to categorize customers for targeted marketing campaigns, thereby optimizing marketing strategies and enhancing customer engagement."
      },
      {
        "project_title": "Extracting & Analyzing Contract Information Using LLMs",
        "description": "I utilized open-source large language models (LLMs), such as LLAMA 2.0 and Mixtral, to extract and analyze contract information from legal documents. This project automated the analysis workflow and provided valuable insights into contract law."
      },
      {
        "project_title": "Large Language Models for Reliable Berlin Public Administration Answers",
        "description": "I developed and deployed a chatbot system for Berlin’s public administration that leveraged various open-source LLMs (including ChatGPT 3.5, LLAMA, Alpaca, Vicuna 13b, Dolly 2.0, and Raven) to provide reliable, context-based answers to public queries."
      },
      {
        "project_title": "Designing Seq2Seq Translation Model with Attention Mechanism",
        "description": "I created a Seq2Seq translation model with an attention mechanism to translate between English and Bulgarian. The project involved using GloVe and fastText embeddings for word representation and training the model using modern deep learning frameworks."
      }
    ]
  }
  